# Day 34

* Handling Missing Values
* Removal Duplicate Records
* Outliers Removal

In [ ]:
import pandas as pd
df = pd.read_csv("sample_data\sample_dirty_dataset.csv")
df

<>:2: SyntaxWarning: invalid escape sequence '\s'
<>:2: SyntaxWarning: invalid escape sequence '\s'
C:\Users\LENOVO\AppData\Local\Temp\ipykernel_17504\4039486168.py:2: SyntaxWarning: invalid escape sequence '\s'
  df = pd.read_csv('sample_data\sample_dirty_dataset.csv')

      Name   Age  Gender   Salary Department
0    Alice  25.0       F  50000.0         HR
1      Bob   NaN       M  60000.0         IT
2  Charlie  30.0       M      NaN    Finance
3    David  22.0       M  45000.0         IT
4      Eve  29.0       F  70000.0         HR
5    Frank  40.0    Male  80000.0        NaN
6    Grace   NaN  Female  75000.0    Finance
7    Alice  25.0       F  50000.0         HR

**I Have a Dataset**
1. In that dataset I have some missing values.
2. I have to fill them.
3. Before filling them, we check for outliers. 
    * If there are outliers we firstly remove them 
4. We fill the missing values.